---
kind: method
id: M:Autodesk.Revit.DB.PaperSourceSet.#ctor
source: html/3c77cb29-49f5-a5d1-9bcf-32e1565abdc5.htm
---
# Autodesk.Revit.DB.PaperSourceSet.#ctor Method

Initializes a new instance of the PaperSourceSet class

## Syntax (C#)
```csharp
public PaperSourceSet()
```